reskontra_requests/req1

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.validius.net/ws/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><ns1:saveInvoiceIn><ns1:login><ns1:customerid>20140127</ns1:customerid><ns1:securitykey>be006f335a0892ca3a4eb72bf1edeb0beabb81773cfaf2ea532549494e7d2d65</ns1:securitykey><ns1:userlogin xsi:nil="true"/></ns1:login><ns1:invoice><ns1:ourcode>our</ns1:ourcode><ns1:invoicedate>2017-08-15</ns1:invoicedate><ns1:duedate>2017-08-29</ns1:duedate><ns1:vatamount>0</ns1:vatamount><ns1:netamount>316.1</ns1:netamount><ns1:amount>316.1</ns1:amount><ns1:overdue_interest>7</ns1:overdue_interest><ns1:payment_control>true</ns1:payment_control><ns1:sendtype>email</ns1:sendtype><ns1:autoconfirm>false</ns1:autoconfirm><ns1:invoice_buyer_address><ns1:name>Jarkko Lehtinen</ns1:name><ns1:street>Nuhjalantie 36 as 3</ns1:street><ns1:postcode>21110</ns1:postcode><ns1:city>Naantali</ns1:city><ns1:email>lemiska@gmail.com</ns1:email><ns1:customertype>person</ns1:customertype></ns1:invoice_buyer_address><ns1:invoicerow><ns1:productcode>UK1</ns1:productcode><ns1:productname>Vesipeuhu, Impivaaran uimahalli, lauantaisin 18:00:00-18:30:00, sisaralennus</ns1:productname><ns1:freetext>Lotta Lehtinen</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>142.00</ns1:unitprice><ns1:discountpercent>10.00</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>127.80</ns1:netamount><ns1:amount>127.80</ns1:amount></ns1:invoicerow><ns1:invoicerow><ns1:productcode>UK1</ns1:productcode><ns1:productname>Alkeet A, Impivaaran uimahalli, lauantaisin 18:30:00-19:05:00, sisaralennus</ns1:productname><ns1:freetext>Minttu Lehtinen</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>147.00</ns1:unitprice><ns1:discountpercent>10.00</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>132.30</ns1:netamount><ns1:amount>132.30</ns1:amount></ns1:invoicerow><ns1:invoicerow><ns1:productcode>JASENYYS17/18</ns1:productcode><ns1:productname>Jäsenyys</ns1:productname><ns1:freetext>Lotta Lehtinen</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>28.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>28.00</ns1:netamount><ns1:amount>28.00</ns1:amount></ns1:invoicerow><ns1:invoicerow><ns1:productcode>JASENYYS17/18</ns1:productcode><ns1:productname>Jäsenyys</ns1:productname><ns1:freetext>Minttu Lehtinen</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>28.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>28.00</ns1:netamount><ns1:amount>28.00</ns1:amount></ns1:invoicerow></ns1:invoice><ns1:invoice><ns1:ourcode>our</ns1:ourcode><ns1:invoicedate>2017-08-15</ns1:invoicedate><ns1:duedate>2017-08-29</ns1:duedate><ns1:vatamount>0</ns1:vatamount><ns1:netamount>175</ns1:netamount><ns1:amount>175</ns1:amount><ns1:overdue_interest>7</ns1:overdue_interest><ns1:payment_control>true</ns1:payment_control><ns1:sendtype>email</ns1:sendtype><ns1:autoconfirm>false</ns1:autoconfirm><ns1:invoice_buyer_address><ns1:name>Katja Tahkoniemi</ns1:name><ns1:street>Nummisuutarintie 10, 21420 Lieto</ns1:street><ns1:postcode>21420</ns1:postcode><ns1:city>Lieto</ns1:city><ns1:email>catya_@msn.com</ns1:email><ns1:customertype>person</ns1:customertype></ns1:invoice_buyer_address><ns1:invoicerow><ns1:productcode>UK1</ns1:productcode><ns1:productname>Easyswim alkeet, Impivaaran uimahalli, sunnuntaisin 17:30:00-18:05:00</ns1:productname><ns1:freetext>Julia Tahkoniemi</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>147.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>147.00</ns1:netamount><ns1:amount>147.00</ns1:amount></ns1:invoicerow><ns1:invoicerow><ns1:productcode>JASENYYS17/18</ns1:productcode><ns1:productname>Jäsenyys</ns1:productname><ns1:freetext>Julia Tahkoniemi</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>28.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>28.00</ns1:netamount><ns1:amount>28.00</ns1:amount></ns1:invoicerow></ns1:invoice><ns1:invoice><ns1:ourcode>our</ns1:ourcode><ns1:invoicedate>2017-08-15</ns1:invoicedate><ns1:duedate>2017-08-29</ns1:duedate><ns1:vatamount>0</ns1:vatamount><ns1:netamount>108</ns1:netamount><ns1:amount>108</ns1:amount><ns1:overdue_interest>7</ns1:overdue_interest><ns1:payment_control>true</ns1:payment_control><ns1:sendtype>email</ns1:sendtype><ns1:autoconfirm>false</ns1:autoconfirm><ns1:invoice_buyer_address><ns1:name>Suvi-Tuuli Tuominen</ns1:name><ns1:street>Jalustinkatu 11 D 26</ns1:street><ns1:postcode>20880</ns1:postcode><ns1:city>Turku</ns1:city><ns1:email>suvituulituominen@hotmail.com</ns1:email><ns1:customertype>person</ns1:customertype></ns1:invoice_buyer_address><ns1:invoicerow><ns1:productcode>UK1</ns1:productcode><ns1:productname>Alkeet A, Epitihia, tiistaisin 17:40:00-18:15:00</ns1:productname><ns1:freetext>Emma Karlsson</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>80.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>80.00</ns1:netamount><ns1:amount>80.00</ns1:amount></ns1:invoicerow><ns1:invoicerow><ns1:productcode>JASENYYS17/18</ns1:productcode><ns1:productname>Jäsenyys</ns1:productname><ns1:freetext>Emma Karlsson</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>28.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>28.00</ns1:netamount><ns1:amount>28.00</ns1:amount></ns1:invoicerow></ns1:invoice><ns1:invoice><ns1:ourcode>our</ns1:ourcode><ns1:invoicedate>2017-08-15</ns1:invoicedate><ns1:duedate>2017-08-29</ns1:duedate><ns1:vatamount>0</ns1:vatamount><ns1:netamount>175</ns1:netamount><ns1:amount>175</ns1:amount><ns1:overdue_interest>7</ns1:overdue_interest><ns1:payment_control>true</ns1:payment_control><ns1:sendtype>email</ns1:sendtype><ns1:autoconfirm>false</ns1:autoconfirm><ns1:invoice_buyer_address><ns1:name>Sini Seppälä</ns1:name><ns1:street>Vehnätie 10</ns1:street><ns1:postcode>21200</ns1:postcode><ns1:city>Raisio</ns1:city><ns1:email>sini.seppala@saunalahti.fi</ns1:email><ns1:customertype>person</ns1:customertype></ns1:invoice_buyer_address><ns1:invoicerow><ns1:productcode>UK1</ns1:productcode><ns1:productname>Alkeet A, Impivaaran uimahalli, lauantaisin 18:30:00-19:05:00</ns1:productname><ns1:freetext>Lauri Miettinen</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>147.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>147.00</ns1:netamount><ns1:amount>147.00</ns1:amount></ns1:invoicerow><ns1:invoicerow><ns1:productcode>JASENYYS17/18</ns1:productcode><ns1:productname>Jäsenyys</ns1:productname><ns1:freetext>Lauri Miettinen</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>28.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>28.00</ns1:netamount><ns1:amount>28.00</ns1:amount></ns1:invoicerow></ns1:invoice><ns1:invoice><ns1:ourcode>our</ns1:ourcode><ns1:invoicedate>2017-08-15</ns1:invoicedate><ns1:duedate>2017-08-29</ns1:duedate><ns1:vatamount>0</ns1:vatamount><ns1:netamount>220</ns1:netamount><ns1:amount>220</ns1:amount><ns1:overdue_interest>7</ns1:overdue_interest><ns1:payment_control>true</ns1:payment_control><ns1:sendtype>email</ns1:sendtype><ns1:autoconfirm>false</ns1:autoconfirm><ns1:invoice_buyer_address><ns1:name>Anu Carpelan</ns1:name><ns1:street>Martinkatu 1 B 19</ns1:street><ns1:postcode>20810</ns1:postcode><ns1:city>Turku</ns1:city><ns1:email>anu.carpelan@fimnet.fi</ns1:email><ns1:customertype>person</ns1:customertype></ns1:invoice_buyer_address><ns1:invoicerow><ns1:productcode>UK1</ns1:productcode><ns1:productname>AIKUISILLE jatkotekniikkakurssi, Ruiskadun AMK, sunnuntaisin 19:00:00-19:50:00</ns1:productname><ns1:freetext>Anu Carpelan</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>192.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>192.00</ns1:netamount><ns1:amount>192.00</ns1:amount></ns1:invoicerow><ns1:invoicerow><ns1:productcode>JASENYYS17/18</ns1:productcode><ns1:productname>Jäsenyys</ns1:productname><ns1:freetext>Anu Carpelan</ns1:freetext><ns1:invoiced_quantity>1</ns1:invoiced_quantity><ns1:invoiced_quantity_type>kpl</ns1:invoiced_quantity_type><ns1:unitprice>28.00</ns1:unitprice><ns1:discountpercent>0</ns1:discountpercent><ns1:vatpercent>0</ns1:vatpercent><ns1:vatamount>0</ns1:vatamount><ns1:netamount>28.00</ns1:netamount><ns1:amount>28.00</ns1:amount></ns1:invoicerow></ns1:invoice></ns1:saveInvoiceIn></SOAP-ENV:Body></SOAP-ENV:Envelope>
